<?php
$xmlstr = <<<XML
<?xml version='1.0' standalone='yes'?>
<advices>
    <advice>
    Запишіть і сфотографуйте серійний номер вашого велосипеда (як правило знаходиться на каретці знизу). Зробіть кілька хороших знімків його особливих прикмет (замінені запчастини, наклейки, подряпини і т.д.). Збережіть все, що було з велосипедом при покупці: наклейки, паспорт, коробки, ярлики, гарантійний сертифікат. Якщо купуєте велосипед з рук — попросіть у продавця документи, які є, а також розписку про те, що він вам продав такий-то велосипед за таку-то суму. Це допоможе вам знайти велосипед в разі крадіжки, і довести, що він ваш, і придбаний на законних підставах.
    </advice>
    <advice>
    Не довіряйте тамбурам, коридорам і коморам таку дорогу річ, як велосипед, тому що в ці місця можна проникнути непомітно від вас. Якщо крім вас тамбуром користуються ще й сусіди, то вони просто можуть забути закрити його.
    </advice>
    <advice>
    Обов’язково возіть з собою велозамок і пристібайте велосипед, навіть якщо залишаєте його без нагляду протягом короткого часу або навіть знаходитесь в полі прямої видимості. Справа в тому, що велосипед при крадіжці, на відміну від інших речей, відмінно допомагає злодію втекти. Розмір і вага велозамка залежить від ступеня вашої обережності: чим надійніший, тим важчий. Але не все так просто.    
    </advice>
</advices>
XML;

$advices = new SimpleXMLElement($xmlstr);
$index = $_GET["index"];
$count = $advices->count();
if ($index>$count-1) echo "Більше порад не залишилось :(";
echo $advices->advice[(int)$index];
?>